interface IPrices {
  충청남도: number;
  공주시: number;
  금산군: number;
  논산시: number;
  당진시: number;
  보령시: number;
  부여군: number;
  서산시: number;
  서천군: number;
  아산시: number;
  예산군: number;
  천안시: number;
  청양군: number;
  태안군: number;
  홍성군: number;
  계롱시: number;
}

export interface IProduct {
  name: string;
  prices: IPrices;
}

const fakeData: IProduct[] = [
  {
    name: '설렁탕',
    prices: {
      충청남도: 6000,
      공주시: 5800,
      금산군: 5900,
      논산시: 6100,
      당진시: 6200,
      보령시: 6300,
      부여군: 6400,
      서산시: 6500,
      서천군: 6600,
      아산시: 6700,
      예산군: 6800,
      천안시: 6900,
      청양군: 7000,
      태안군: 7100,
      홍성군: 5700,
      계롱시: 5600,
    },
  },
  {
    name: '라면',
    prices: {
      충청남도: 4000,
      공주시: 4800,
      금산군: 4900,
      논산시: 4100,
      당진시: 4200,
      보령시: 4300,
      부여군: 4400,
      서산시: 4400,
      서천군: 4400,
      아산시: 4700,
      예산군: 4800,
      천안시: 4900,
      청양군: 4000,
      태안군: 4100,
      홍성군: 4700,
      계롱시: 4600,
    },
  },
  {
    name: '김밥',
    prices: {
      충청남도: 3000,
      공주시: 3800,
      금산군: 3900,
      논산시: 3100,
      당진시: 3200,
      보령시: 3300,
      부여군: 3300,
      서산시: 3300,
      서천군: 3300,
      아산시: 3700,
      예산군: 3800,
      천안시: 3900,
      청양군: 3000,
      태안군: 3100,
      홍성군: 3700,
      계롱시: 3600,
    },
  },
];

export default fakeData;
